const cities = {
  თბილისი: {
    ლილო: 25,
    რუსთავი: 30,
    მარნეული: 45,
    თელავი: 116,
    გორი: 86,
    საჩხერე: 173,
    ქუთაისი: 260,
    ზუგდიდი: 356,
    ბათუმი: 398,
  },
  ბათუმი: {
    ზუგდიდი: 126,
    ქუთაისი: 152,
    საჩხერე: 227,
    გორი: 278,
    ლილო: 378,
    რუსთავი: 381,
    მარნეული: 395,
    თელავი: 450,
  },
  ქუთაისი: {
    საჩხერე: 90,
    ზუგდიდი: 110,
    ლილო: 279,
    რუსთავი: 246,
    მარნეული: 260,
    თელავი: 315,
  },
  ზუგდიდი: {
    საჩხერე: 190,
    ლილო: 340,
    რუსთავი: 356,
    მარნეული: 364,
    თელავი: 413,
  },
}

export default cities
